;
; ITEMS
;

[Support_Artillery_Offensive_MortarStrike_HE_T1 X2WeaponTemplate]
FriendlyName="Fire Support: HE Mortar Shells"
FriendlyNamePlural="Fire Support: HE Mortar Shells"
BriefSummary="A radio with its frequency set to call in fire support at the designated area."
TacticalText="<Bullet/>A radio set that's specifically tuned to call in a specific fire support.\n<Bullet/>HE Mortar Shells: An offensive Fire Support that drops 3 shells at a given area.\n<Bullet/>No guarentee for accuracy.\n<Bullet/>Cannot be used underground or inside massive buildings or building complexes."
AbilityDescName="support strike"

[Support_Artillery_Defensive_MortarStrike_SMK_T1 X2WeaponTemplate]
FriendlyName="Fire Support: Smoke Mortar Shells"
FriendlyNamePlural="Fire Support: Smoke Mortar Shells"
BriefSummary="A radio with its frequency set to call in fire support at the designated area."
TacticalText="<Bullet/>A radio set that's specifically tuned to call in a specific fire support.\n<Bullet/>Smoke Mortar Shells: A defensive Fire Support that drops 3 smoke shells at a given area.\n<Bullet/>Units that are inside the smoke are unaffected by Overwatch, however, units that move outside the smoke or units that move into the smoke will be affected by Overwatch.\n<Bullet/>Quicker than HE mortar shells.\n<Bullet/>No guarentee for accuracy.\n<Bullet/>Cannot be used underground or inside massive buildings or building complexes."
AbilityDescName="support strike"

;
; ABILITIES
;

[Ability_Support_Land_Off_MortarStrike_HE_Stage1 X2AbilityTemplate]
LocFriendlyName="Request Strike: HE Mortar Shells"
LocLongDescription="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\nRequests high explosive artillery support at the designated site. Highly inaccurate and requires timing and luck to pull off. The specified area will be pelted with salvo for a couple of turns."
LocHelpText="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\n Delayed H.E artillery at the requested site."
LocFlyOverText="Strike requested: H.E. artillery"

[Ability_Support_Land_Off_MortarStrike_HE_Stage2 X2AbilityTemplate]
LocLongDescription="Report this bug to E3 if you see this appear."
LocHelpText="Report this bug to E3 if you see this appear."



[Ability_Support_Land_Def_MortarStrike_SMK_Stage1 X2AbilityTemplate]
LocFriendlyName="Request Strike: Smoke Mortar Shells"
LocLongDescription="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\nRequests smoke artillery support at the designated site, where it will be pelted with smoke shells for a couple of turns. Smoke lasts for 6 turns and does not trigger overwatch while inside the smoke. However, units that try to move into the smoke, or move outside the smoke will be affected by overwatch."
LocHelpText="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\n Delayed smoke artillery at the requested site that dissapates after 6 turns. Does not trigger Overwatch while inside of it, but any units that attempt to leave or move into the smoke will trigger Overwatch."
LocFlyOverText="Strike requested: Smoke artillery"

[Ability_Support_Land_Def_MortarStrike_SMK_Stage2 X2AbilityTemplate]
LocLongDescription="Report this bug to E3 if you see this appear."
LocHelpText="Report this bug to E3 if you see this appear."

;
; SMOKE EFFECTS
;

MortarStrike_Stage2_SMK_EffectDisplayName="Thick Smoke"
MortarStrike_Stage2_SMK_EffectDisplayDesc="The thick smoke grants this unit immunity to Overwatch and a defensive bonus, but suffers an aim penalty."